# Задание 4:
    # Вам даны несколько последовательностей чисел:
    # sequence_0 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0)
    # sequence_1 = (14,10,35,45,'60',70,90,0,105,150,'70')
    # sequence_2 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0)
    # sequence_3 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70')

    # Нужно проверить, все ли числа в КАЖДОЙ последовательности уникальны.
    # Если в последовательности были найдены дубликаты ---> Выведите на экран: "Последовательность не уникальна."
    # Если в последовательности дубликатов найдено не было ---> Выведите на экран: "Последовательность уникальна."
    # Если в решении задания не присутствует цикл ---> Задание не защитано.
sequence_0 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0)
sequence_1 = (14,10,35,45,'60',70,90,0,105,150,'70')
sequence_2 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0)
sequence_3 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70')


count = 0
for i in sequence_0:
    if sequence_0.count(i) != 1:
        count += 1
if count > 0:
    print('Последовательность sequence_0 не уникальна')
else:
    print('Последовательность sequence_0 уникальна')

count = 0
for i in sequence_1:
    if sequence_1.count(i) != 1:
        count += 1
if count > 0:
    print('Последовательность sequence_1 не уникальна')
else:
    print('Последовательность sequence_1 уникальна')

count = 0
for i in sequence_2:
    if sequence_2.count(i) != 1:
        count += 1
if count > 0:
    print('Последовательность sequence_2 не уникальна')
else:
    print('Последовательность sequence_2 уникальна')

count = 0
for i in sequence_3:
    if sequence_3.count(i) != 1:
        count += 1
if count > 0:
    print('Последовательность sequence_3 не уникальна')
else:
    print('Последовательность sequence_3 уникальна')

