# Задание 3:
    # Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата.

a = int(input('Введите длину стороны квадрата: '))
print('Периметр квадрата:', a*4)
print('Площадь квадрата:', a**2)
