
# Задание №5:
# Какое слово нужно сложить 5 раз чтобы получить число 5?
# Какое слово нужно умножить на 7 чтобы получить 7?

name = ['abdrey','alex' ,'oly','jon','djek']
print(str(len(name)))

s= input('enter the number')
print(len(s))
print(s*1)

name = input('enter the number')
print(len(name))
print(name+'1')




