# Задание 6:
# Дан список чисел:
# numbers = [1,0,-2,4,3,6,6,3,5,8,4,2]
# Выведите все элементы списка, которые больше предущего элемента
# Пример: (numbers: 1,5,2,4,3 Результат: 5,4)

numbers = [1,0,-2,4,3,6,6,3,5,8,4,2]

for i in range(len(numbers)):
    if numbers[i] > numbers[i-1]:
        print(numbers[i])
