# Задание 3:
# Вам дан список:
# numbers = [2,4,7,1,8.4,-3.3,7.1,-2,4,-1,7,-43,8,-3,6,9]
# Определите количество четных и не четных.

numbers = [2,4,7,1,8.4,-3.3,7.1,-2,4,-1,7,-43,8,-3,6,9]
count1 = 0
count2 = 0
for number in numbers:
    if number % 2 == 0:
        count1 += 1
    else:
        count2 += 1
print('Кол-во четных чисел', count1)
print('Кол-во нечетных чисел', count2)